Embedfire-stm32f429-tiaozhanzhe/ebf_stm32f429_tiaozhanzhe_std_code/RTC—实时时钟-修改OK/USER/Bsp/RTC/bsp_rtc.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2015-xx-xx
  * @brief   RTC驱动
  ******************************************************************************
  * @attention
  *
  * 实验平台:秉火  STM32 F429 开发板 
  * 论坛    :http://www.chuxue123.com
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */
  
#include "stm32f4xx.h"
#include "./Bsp/RTC/bsp_rtc.h"
#include "./Bsp/usart/bsp_debug_usart.h"

// 选择 RTC 时钟源，配置同步/异步预分频器的值
#define RTC_CLOCK_SOURCE_LSE
//#define RTC_CLOCK_SOURCE_LSI

#define LSE_STARTUP_TIMEOUT     ((uint16_t)0x05000)

void RTC_Config(void)
{  
  __IO uint16_t StartUpCounter = 0;
	FlagStatus LSEStatus = RESET;	
	RTC_InitTypeDef RTC_InitStructure;
	
	// 使能 PWR 时钟
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
  // PWR_CR:DBF置1，使能RTC、RTC备份寄存器和备份SRAM的访问
  PWR_BackupAccessCmd(ENABLE);
	
/*=========================选择RTC时钟源==============================*/
// 默认使用LSE，如果LSE出故障则使用LSI 
  //使能LSE
  RCC_LSEConfig(RCC_LSE_ON);	
	
	// 等待LSE启动稳定，如果超时则退出
  do
  {
    LSEStatus = RCC_GetFlagStatus(RCC_FLAG_LSERDY);
    StartUpCounter++;
  }while((LSEStatus == RESET) && (StartUpCounter != LSE_STARTUP_TIMEOUT));
	
	
	if(LSEStatus == SET )
  {
		printf("\n\r LSE 启动成功 \r\n");
		// 选择LSE作为RTC的时钟源
		RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
  }
	else
	{
		printf("\n\r LSE 故障，转为使用LSI \r\n");
		
		// 使能LSI	
		RCC_LSICmd(ENABLE);
		// 等待LSI稳定 
		while(RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
		{			
		}
		
		printf("\n\r LSI 启动成功 \r\n");
		// 选择LSI作为RTC的时钟源
		RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);
	}
	
  // 使能 RTC 时钟
  RCC_RTCCLKCmd(ENABLE);
  // 等待 RTC APB 寄存器同步
  RTC_WaitForSynchro();

/*=====================初始化同步/异步预分频器的值======================*/
	// 驱动日历的时钟ck_spare = LSE/[(255+1)*(127+1)] = 1HZ
	
	// 设置异步预分频器的值为127
	RTC_InitStructure.RTC_AsynchPrediv = 127;
	// 设置同步预分频器的值为255
	RTC_InitStructure.RTC_SynchPrediv = 255;	
	RTC_InitStructure.RTC_HourFormat = RTC_HourFormat_24; 
	// 用RTC_InitStructure的内容初始化RTC寄存器
	if (RTC_Init(&RTC_InitStructure) == ERROR)
	{
		printf("\n\r RTC 时钟初始化失败 \r\n");
	}	
}

// 设置时间和日期
void RTC_TimeAndDate_Init(void)
{
	RTC_TimeTypeDef RTC_TimeStructure;
	RTC_DateTypeDef RTC_DateStructure;
	
		// 初始化时间
	RTC_TimeStructure.RTC_H12 = RTC_H12_AM;
	RTC_TimeStructure.RTC_Hours = 0;        // 0~23
	RTC_TimeStructure.RTC_Minutes = 0;      // 0~59
	RTC_TimeStructure.RTC_Seconds = 0;      // 0~59
	RTC_SetTime(RTC_Format_BIN, &RTC_TimeStructure);
	RTC_WriteBackupRegister(RTC_BKP_DR0, 0x32F2);
	
  // 初始化日期	
	RTC_DateStructure.RTC_WeekDay = 1;       // 1~7
	RTC_DateStructure.RTC_Date = 29;         // 1~31
	RTC_DateStructure.RTC_Month = 3;         // 1~12
	RTC_DateStructure.RTC_Year = 16;         // 0~99
	RTC_SetDate(RTC_Format_BIN, &RTC_DateStructure);
	RTC_WriteBackupRegister(RTC_BKP_DR0, 0x32F2);
}

// 显示时间和日期
void RTC_TimeAndDate_Show(void)
{
	uint8_t Rtctmp=0;
	RTC_TimeTypeDef RTC_TimeStructure;
	RTC_DateTypeDef RTC_DateStructure;
	
	while(1)
	{
		// 获取日历
    RTC_GetTime(RTC_Format_BIN, &RTC_TimeStructure);
	  RTC_GetDate(RTC_Format_BIN, &RTC_DateStructure);
		
		// 每秒打印一次
  	if(Rtctmp != RTC_TimeStructure.RTC_Seconds)
    {
			// 打印日期
      printf("The Date :  Y:20%0.2d - M:%0.2d - D:%0.2d - W:%0.2d\r\n", 
			RTC_DateStructure.RTC_Year,
			RTC_DateStructure.RTC_Month, 
			RTC_DateStructure.RTC_Date,
			RTC_DateStructure.RTC_WeekDay);
			
			// 打印时间
      printf("The Time :  %0.2d:%0.2d:%0.2d \r\n\r\n", 
			RTC_TimeStructure.RTC_Hours, 
			RTC_TimeStructure.RTC_Minutes, 
			RTC_TimeStructure.RTC_Seconds);
			
      (void)RTC->DR;
    }
    Rtctmp = RTC_TimeStructure.RTC_Seconds;
	}	
}



